1.Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [2]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [18]:
def rentals_month(engine, month, year):
    consulta = f"""
    select *
    from rental
    where month(rental_date) = {month} and year(rental_date) = {year}
    ;
    """ 
    df = pd.read_sql(consulta, con=engine)
    return df

In [38]:
rentals_month(engine,"7","2005")

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

3 Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [33]:
def rental_count_month(df,month, year):
    df = df.groupby("customer_id")["rental_id"].count()
    df = pd.DataFrame(df)
    df.rename(columns={"rental_id":f"rentals_{month}_{year}"}, inplace=True)

    return df

In [34]:
rental_count_month(rentals_month(engine,"5","2005"),"05","2005")

             rentals_05_2005
customer_id
1                          2
2                          1
3                          2
5                          3
6                          3
...                      ...
594                        4
595                        1
596                        6
597                        2
599                        1

[520 rows x 1 columns]

In [40]:
def compare_rentals(df1,month1,year1, df2,month2,year2):
    df1 = rental_count_month(df1,month1,year1)
    df2 = rental_count_month(df2,month2,year2)

    df_merged = pd.merge(df1,df2, on="customer_id", how = "inner")
    df_merged["difference"] = df_merged[f"rentals_{month1}_{year1}"] - df_merged[f"rentals_{month2}_{year2}"]

    return df_merged

In [41]:
compare_rentals(rentals_month(engine,"7","2005"),"07","2005",rentals_month(engine,"5","2005"),"05","2005")

             rentals_07_2005  rentals_05_2005  difference
customer_id
1                         12                2          10
2                         14                1          13
3                         13                2          11
5                         16                3          13
6                          9                3           6
...                      ...              ...         ...
594                       14                4          10
595                       19                1          18
596                        6                6           0
597                        7                2           5
599                        7                1           6

[520 rows x 3 columns]